[{"fact":"&#8220;Brokeback Mountain&#8221; is not just a movie. It&#8217;s also what Chuck Norris calls the pile of dead ninjas in his front yard."},
{"fact":"&#8220;Icy-Hot&#8221; is too weak for Chuck Norris. After a workout, Chuck Norris rubs his muscles down with liquid-hot MAGMA."},
{"fact":"&#8220;Let the Bodies Hit the Floor&#8221; was originally written as Chuck Norris&#8217; theme song."},
{"fact":"&#8220;Wo hu cang long&#8221;. The translation from Mandarin Chinese reads: &#8220;Crouching Chuck, Hidden Norris&#8221;."},
{"fact":"182,000 Americans die from Chuck Norris-related accidents every year."},
{"fact":"4 out of 5 doctors fail to recommend Chuck Norris as a solution to most problems. Also,80% of doctors die unexplained, needlessly brutal deaths."},
{"fact":"70% of a human&#8217;s weight is water. 70% of Chuck Norris&#8217; weight is his dick."},
{"fact":"A blind man once stepped on Chuck Norris&#8217; shoe. Chuck replied, &#8220;Don&#8217;t you know who I am? I&#8217;m Chuck Norris!&#8221; The mere mention of his name cured this man blindness. Sadly the first, last, and only thing this man ever saw, was a fatal roundhouse delivered by Chuck Norris."},
{"fact":"A Chuck Norris-delivered roundhouse-kick is the preferred method of execution in 16 states."},
{"fact":"A Handicap parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there."},
{"fact":"A high tide means Chuck Norris is flying over your coast. The tide is caused by God pissing his pants."},
{"fact":"A man once asked Chuck Norris if his real name is &#8220;Charles&#8221;. Chuck Norris did not respond, he simply stared at him until he exploded."},
{"fact":"A man once claimed Chuck Norris kicked his ass twice, but it was promptly dismissed as false &#8211; no one could survive it the first time."},
{"fact":"A man once taunted Chuck Norris with a bag of Lay&#8217;s potato chips, saying &#8220;Betcha cannot eat just one!&#8221; Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move."},
{"fact":"A movie scene depicting Chuck Norris losing a fight with Bruce Lee was the product of history&#8217;s most expensive visual effect. When adjusted for inflation, the effect cost more than the Gross National Product of Paraguay."},
{"fact":"A picture is worth a thousand words. A Chuck Norris is worth 1 billion words."},
{"fact":"A study showed the leading causes of death in the United States are: 1. Heart disease, 2. Chuck Norris, 3. Cancer."},
{"fact":"According to Einstein&#8217;s theory of relativity, Chuck Norris can actually roundhouse-kick you yesterday."},
{"fact":"According to the Bible, God created the universe in six days. Before that, Chuck Norris created God by snapping his fingers."},
{"fact":"According to the Encyclopedia Britannica, the Native American &#8220;Trail of Tears&#8221; has been redefined as anywhere that Chuck Norris walks."},
{"fact":"After returning from World War 2 unscathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history."},
{"fact":"After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said &#8220;of course my urine tested positive, what do you think they make steroids from?&#8221;."},
{"fact":"Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on."},
{"fact":"All roads lead to Chuck Norris. And by the transitive property, a roundhouse-kick to the face."},
{"fact":"Along with his black belt, Chuck Norris often chooses to wear brown shoes. No one has DARED call him on it. Ever."},
{"fact":"An anagram for Walker Texas Ranger is KARATE WRANGLER SEX. I do not know what that is, but it sounds AWESOME."},
{"fact":"Anytime someone is elected president in the United States, they must ask permission from Chuck Norris to live in the White House. The reason for this is because Chuck Norris had won every Federal, State, and Local election since 1777. He just allows others to run the country in his place."},
{"fact":"Archeologists in India recently uncovered a new dinosaur. It&#8217;s actually many dinosaurs but one is in the middle of all the others. The one in the middle is believed to have killed the others with a single roundhouse-kick to the face. The archeologists wanted to call it ChuckNorrisaurs but the Indian government changed the name to Himotosaurous because it&#8217;s simply not possible for Mr. Norris to be killed."},
{"fact":"Archeologists unearthed an old English dictionary dating back to the year 1236. It defined &#8220;victim&#8221; as &#8220;one who has encountered Chuck Norris&#8221;."},
{"fact":"As a child, Chuck Norris played Hungry Hippos with real hippos."},
{"fact":"As a teen, Chuck Norris had sex with every nun in a convent tucked away in the hills of Tuscany. Nine months later the nuns gave birth to the 1972 Miami Dolphins, the only undefeated and untied team in professional football history."},
{"fact":"As an infant, Chuck Norris&#8217; parents gave him a toy hammer. He gave the world Stonehenge."},
{"fact":"As President Roosevelt said: &#8220;We have nothing to fear but fear itself. And Chuck Norris&#8221;."},
{"fact":"At birth, Chuck Norris came out feet first so he could roundhouse-kick the doctor in the face. Nobody delivers Chuck Norris but Chuck Norris."},
{"fact":"Before each filming of Walker: Texas Ranger, Chuck Norris is injected with fourteen times the lethal dose of elephant tranquilizer. This is, of course, to limit his strength and mobility, in an attempt to lower the fatality rate of the actors he fights."},
{"fact":"Before sliced bread, people used to say &#8220;That&#8217;s the greatest thing since Chuck Norris&#8221;. But Chuck Norris was displeased by this. So he roundhouse-kicked a loaf of bread into slices."},
{"fact":"Behind every successful man, there is a woman. Behind every dead man, there is Chuck Norris."},
{"fact":"Cars were invented to have a faster way of fleeing from Chuck Norris. Not to be outdone, Chuck Norris invented the car accident."},
{"fact":"Chuck Norris actually built the stairway to heaven."},
{"fact":"Chuck Norris actually owns IBM. It was an extremely hostile takeover."},
{"fact":"Chuck Norris always gets blackjack. Even when he&#8217;s playing poker."},
{"fact":"Chuck Norris always knows the EXACT location of Carmen San Diego."},
{"fact":"Chuck Norris and Mr. T walked into a bar. The bar was instantly destroyed, as that level of awesome cannot be contained in one building."},
{"fact":"Chuck Norris began selling the Total Gym as an ill-fated attempt to make his day-to-day opponents less laughably pathetic."},
{"fact":"Chuck Norris brushes his teeth with a mixture of iron shavings, industrial paint remover, and wood-grain alcohol."},
{"fact":"Chuck Norris brushes his teeth with barbed wire."},
{"fact":"Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door."},
{"fact":"Chuck Norris built a time machine and went back in time to stop the JFK assassination. As Oswald shot, Chuck met all three bullets with his beard, deflecting them. JFK&#8217;s head exploded out of sheer amazement."},
{"fact":"Chuck Norris can be unlocked on the hardest level of Tekken. But only Chuck Norris is skilled enough to unlock himself. Then he roundhouse-kicks the Playstation back to Japan."},
{"fact":"Chuck Norris CAN believe it&#8217;s not butter."},
{"fact":"Chuck Norris can blow bubbles with beef jerky."},
{"fact":"Chuck Norris can cook minute rice in 30 seconds."},
{"fact":"Chuck Norris can divide by zero."},
{"fact":"Chuck Norris can do a roundhouse-kick faster than the speed of light. This means that if you turn on a light switch, you will be dead before the light bulb turns on."},
{"fact":"Chuck Norris can download Metallica mp3s using Napster."},
{"fact":"Chuck Norris can drink an entire gallon of milk in thirty-seven seconds."},
{"fact":"Chuck Norris can edit PDF files."},
{"fact":"Chuck Norris can find his car keys."},
{"fact":"Chuck Norris can get Blackjack with just one card."},
{"fact":"Chuck Norris can hit you so hard that he can actually alter your DNA. Decades from now your descendants will occasionally clutch their heads and yell &#8220;What The Hell was That?&#8221;."},
{"fact":"Chuck Norris can hold his breathe for nine years."},
{"fact":"Chuck Norris can in fact &#8216;raise the roof&#8217;. And he can do it with one hand."},
{"fact":"Chuck Norris can judge a book by its cover."},
{"fact":"Chuck Norris can jump-start a car using jumper cables attached to his nipples."},
{"fact":"Chuck Norris can kick through all 6 degrees of separation, hitting anyone, anywhere, in the face, at any time."},
{"fact":"Chuck Norris can lead a horse to water AND make it drink."},
{"fact":"Chuck Norris can paste pics in Notepad."},
{"fact":"Chuck Norris can program a MAC with excel macros."},
{"fact":"Chuck Norris can set ants on fire with a magnifying glass. At night."},
{"fact":"Chuck Norris can skeletize a cow in two minutes."},
{"fact":"Chuck Norris can slam revolving doors."},
{"fact":"Chuck Norris can sneeze with his eyes open."},
{"fact":"Chuck Norris can speak braille."},
{"fact":"Chuck Norris can split the atom. With his bare hands."},
{"fact":"Chuck Norris can taste lies."},
{"fact":"Chuck Norris can touch MC Hammer."},
{"fact":"Chuck Norris can watch an episode of 60 minutes in 22 seconds."},
{"fact":"Chuck Norris can win a game of Connect Four in only three moves."},
{"fact":"Chuck Norris can win a game of Trivial Pursuit with one roll of the dice, and without answering a single question &#8230; just a nod of the head, and a stroke of the beard."},
{"fact":"Chuck Norris can win at solitaire with only 18 cards."},
{"fact":"Chuck Norris can write DVDs on floppy drive."},
{"fact":"Chuck Norris cannot finish a &#8220;color by numbers&#8221; because his markers are filled with the blood of his victims. Unfortunately, all blood is dark red."},
{"fact":"Chuck Norris cannot love, he can only not kill."},
{"fact":"Chuck Norris clogs the toilet even when he pisses."},
{"fact":"Chuck Norris could shoot someone and still have time to roundhouse-kick him in the face before the bullet hit."},
{"fact":"Chuck Norris counted to infinity &#8211; twice."},
{"fact":"Chuck Norris CPU doesn&#8217;t have a fan."},
{"fact":"Chuck Norris crossed the road. No one has ever dared question his motives."},
{"fact":"Chuck Norris describes human beings as &#8220;a sociable holder for blood and guts&#8221;."},
{"fact":"Chuck Norris destroyed the periodic table, because Chuck Norris only recognizes the element of surprise."},
{"fact":"Chuck Norris did in fact, build Rome in a day."},
{"fact":"Chuck Norris did not &#8220;lose&#8221; his virginity, he stalked it and then destroyed it with extreme prejudice."},
{"fact":"Chuck Norris died ten years ago, but the Grim Reaper cannot get up the courage to tell him."},
{"fact":"Chuck Norris discovered a new theory of relativity involving multiple universes in which Chuck Norris is even more badass than in this one. When it was discovered by Albert Einstein and made public, Chuck Norris roundhouse-kicked him in the face. We know Albert Einstein today as Stephen Hawking."},
{"fact":"Chuck Norris does know what Willis is talking about!"},
{"fact":"Chuck Norris does not &#8220;style&#8221; his hair. It lays perfectly in place out of sheer terror."},
{"fact":"Chuck Norris does not actually write books, the words assemble themselves out of fear."},
{"fact":"Chuck Norris does not believe in Germany."},
{"fact":"Chuck Norris does not believe in ravioli. He stuffs a live turtle with beef and smothers it in pig&#8217;s blood."},
{"fact":"Chuck Norris does not bowl strikes, he just knocks down one pin and the other nine faint."},
{"fact":"Chuck Norris does not chew gum. Chuck Norris chews tin foil."},
{"fact":"Chuck Norris does not churn butter. He roundhouse-kicks the cows and the butter comes straight out."},
{"fact":"Chuck Norris does not consider it sex if the woman survives."},
{"fact":"Chuck Norris does not daydream. He&#8217;s too busy giving other people nightmares."},
{"fact":"Chuck Norris does not eat. Food understands that the only safe haven from Chuck Norris&#8217; fists is inside his own body."},
{"fact":"Chuck Norris does not follow fashion trends, they follow him. But then he turns around and kicks their ass. Nobody follows Chuck Norris."},
{"fact":"Chuck Norris does not get frostbite. Chuck Norris bites frost."},
{"fact":"Chuck Norris does not give Christmas presents. If you live to see Christmas, that is your Christmas present from Chuck."},
{"fact":"Chuck Norris does not go at the speed of light, he goes at the speed of Norris."},
{"fact":"Chuck Norris does not go hunting &#8230; Chuck Norris GOES KILLING."},
{"fact":"Chuck Norris does not go on the Internet, he has every Internet site stored in his memory. He refreshes web pages by blinking."},
{"fact":"Chuck Norris does not have a bank account. He just tells the bank how much he needs."},
{"fact":"Chuck Norris does not have blood. He is filled with magma."},
{"fact":"Chuck Norris does not have hair on his testicles, because hair does not grow on steel."},
{"fact":"Chuck Norris does not have to answer the phone. His beard picks up the incoming electrical impulses and translates them into audible sound."},
{"fact":"Chuck Norris does not hunt because the word hunting implies the possibility of failure. Chuck Norris goes killing."},
{"fact":"Chuck Norris does not kick ass and take names. In fact, Chuck Norris kicks ass and assigns the corpse a number. It is currently recorded to be in the billions."},
{"fact":"Chuck Norris does not kill two birds with one stone. Chuck Norris kills all birds, with two stones. The ones in his pants."},
{"fact":"Chuck Norris does not know about this website. If he did he would have just deleted the Internet."},
{"fact":"Chuck Norris does not know where you live, but he knows where you will die."},
{"fact":"Chuck Norris does not leave messages. Chuck Norris leaves warnings."},
{"fact":"Chuck Norris does not look both ways before he crosses the street &#8230; he just roundhouses any cars that get too close."},
{"fact":"Chuck Norris does not open a can of whoopass. He makes his own."},
{"fact":"Chuck Norris does not own a can opener, he just chews through the can."},
{"fact":"Chuck Norris does not own a house. He walks into random houses and people move."},
{"fact":"Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold."},
{"fact":"Chuck Norris does not play God. Playing is for children."},
{"fact":"Chuck Norris does not play the lottery. It does not have nearly enough balls."},
{"fact":"Chuck Norris does not read books. He stares them down until he gets the information he wants."},
{"fact":"Chuck Norris does not say &#8220;who&#8217;s your daddy&#8221;, because he knows the answer."},
{"fact":"Chuck Norris does not see dead people. He makes people dead."},
{"fact":"Chuck Norris does not shave; he kicks himself in the face. The only thing that can cut Chuck Norris is Chuck Norris."},
{"fact":"Chuck Norris does not shower, he only takes blood baths."},
{"fact":"Chuck Norris does not sleep. He waits."},
{"fact":"Chuck Norris does not step on toes. Chuck Norris steps on necks."},
{"fact":"Chuck Norris does not stub his toes. He accidentally destroys chairs, bed frames, and sidewalks."},
{"fact":"Chuck Norris does not teabag the ladies. He potato-sacks them."},
{"fact":"Chuck Norris does not throw up if he drinks too much. Chuck Norris throws down!"},
{"fact":"Chuck Norris does not understand why you should consult your doctor if your erection lasts for more than 4 hours. His erections have been known to last for up to 15 days."},
{"fact":"Chuck Norris does not use a web server. His beard serves HTTP."},
{"fact":"Chuck Norris does not use after shave, he uses liquid hot magma."},
{"fact":"Chuck Norris does not use pickup lines, he simply says, &#8220;Now.&#8221;."},
{"fact":"Chuck Norris does not wash his clothes, he disembowels them."},
{"fact":"Chuck Norris does not wear a condom. Because there is no such thing as protection from Chuck Norris."},
{"fact":"Chuck Norris does not wear a watch, HE decides what time it is."},
{"fact":"Chuck Norris does, in fact, live in a round house."},
{"fact":"Chuck Norris drinks napalm to quell his heartburn."},
{"fact":"Chuck Norris drives an ice cream truck covered in human skulls."},
{"fact":"Chuck Norris eats a bowl of diamonds every morning."},
{"fact":"Chuck Norris eats beef jerky and craps gunpowder. Then, he uses that gunpowder to make a bullet, which he uses to kill a cow and make more beef jerky. Some people refer to this as the &#8220;Circle of Life&#8221;."},
{"fact":"Chuck Norris eats eight meals a day. Seven are steak, and the last is the rest of the cow."},
{"fact":"Chuck Norris eats lightning and farts thunder."},
{"fact":"Chuck Norris eats steak for every single meal. Most times he forgets to kill the cow."},
{"fact":"Chuck Norris ends every relationship with &#8220;Its not me, its you&#8221;."},
{"fact":"Chuck Norris enjoys a good practical joke. His favourite is where he removes your lower intestine and pretends to make a balloon animal out of it. Then he cracks your skull open with a Volvo for not complimenting him on his balloon animal."},
{"fact":"Chuck Norris frequently donates blood to the Red Cross. Just never his own."},
{"fact":"Chuck Norris frequently signs up for beginner karate classes, just so he can &#8220;accidentally&#8221; beat the shit out of little kids."},
{"fact":"Chuck Norris gave Mona Lisa that smile."},
{"fact":"Chuck Norris got a perfect score on his SATs, simply by writing Chuck Norris for every answer."},
{"fact":"Chuck Norris got Helen Keller to talk."},
{"fact":"Chuck Norris got his drivers license at the age of 16. Seconds."},
{"fact":"Chuck Norris got in touch with his feminine side, and promptly got her pregnant."},
{"fact":"Chuck Norris graduated from school with a degree in Chuck Norris."},
{"fact":"Chuck Norris grinds his coffee with his teeth and boils the water with his own rage."},
{"fact":"Chuck Norris had to stop washing his clothes in the ocean. The tsunamis were killing people."},
{"fact":"Chuck Norris has 12 moons. One of those moons is the Earth."},
{"fact":"Chuck Norris has 3 knees on each leg."},
{"fact":"Chuck Norris has a deep and abiding respect for human life &#8230; unless it gets in his way."},
{"fact":"Chuck Norris has a pet kitten &#8211; every night for a snack."},
{"fact":"Chuck Norris has a yahoo account with Hotmail."},
{"fact":"Chuck Norris has an Intel CPU on an AMD motherboard."},
{"fact":"Chuck Norris has an open API. His right leg, coming straight at your face."},
{"fact":"Chuck Norris has banned rainbows from the state of North Dakota."},
{"fact":"Chuck Norris has held the World Championship in every weight class at the same time."},
{"fact":"Chuck Norris has never been accused of murder for the simple fact that his roundhouse-kicks are recognized world-wide as &#8220;acts of God&#8221;."},
{"fact":"Chuck Norris has never been in a fight, ever. Do you call one roundhouse-kick to the face a fight?"},
{"fact":"Chuck Norris has never had an alcohol problem. However, alcohol has had a Chuck Norris problem."},
{"fact":"Chuck Norris has never looked a baby in the eyes cause it might make him cry but if he does it also makes him want to punch a baby."},
{"fact":"Chuck Norris has never won an Academy Award for acting &#8230; because he&#8217;s not acting."},
{"fact":"Chuck Norris has only one hand: the upper hand."},
{"fact":"Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoly card, a 2 of clubs,7 of spades and a green #4 card from the game UNO."},
{"fact":"Chuck Norris has the heart of a little boy. In a jar. On his desk."},
{"fact":"Chuck Norris has the IP 0.0.0.0."},
{"fact":"Chuck Norris has to chain his mouse to his desktop."},
{"fact":"Chuck Norris has to maintain a concealed weapon license in all 50 states in order to legally wear pants."},
{"fact":"Chuck Norris has to register every part of his body as a separate lethal weapon. His spleen is considered a concealed weapon in over 50 states."},
{"fact":"Chuck Norris has to sort his laundry into three loads: darks, whites, and bloodstains."},
{"fact":"Chuck Norris has to use a stunt double when he does crying scenes."},
{"fact":"Chuck Norris has two speeds: Walk and Kill."},
{"fact":"Chuck Norris has volunteered to remain on earth after the Rapture; he will spend his time fighting the Anti-Christ."},
{"fact":"Chuck Norris has Windows XP on his Apple Mac PowerPC."},
{"fact":"Chuck Norris hates The Beatles; two to go."},
{"fact":"Chuck Norris invented a language that incorporates karate and roundhouse-kicks. So next time Chuck Norris is kicking your ass, do not be offended or hurt, he may be just trying to tell you he likes your hat."},
{"fact":"Chuck Norris invented all 32 letters of the alphabet."},
{"fact":"Chuck Norris invented black. In fact, he invented the entire spectrum of visible light. Except pink. Tom Cruise invented pink."},
{"fact":"Chuck Norris invented C++ after roundhouse-kicking C. Twice."},
{"fact":"Chuck Norris invented his own type of karate. It&#8217;s called Chuck-Will-Kill."},
{"fact":"Chuck Norris invented Kentucky Fried Chicken&#8217;s famous secret recipe, with eleven herbs and spices. But nobody ever mentions the twelfth ingredient: Fear."},
{"fact":"Chuck Norris invented the bolt-action rifle, liquor, sexual intercourse, and football&#8211; in that order."},
{"fact":"Chuck Norris invented the Internet &#8230; just so he had a place to store his porn."},
{"fact":"Chuck Norris invented the Internet."},
{"fact":"Chuck Norris invented the question mark."},
{"fact":"Chuck Norris is &#8220;The best a man can get&#8221;."},
{"fact":"Chuck Norris is a vegetarian. Meaning, he does not eat animals until first he puts them into vegetative state with his fists."},
{"fact":"Chuck Norris is allowed to talk about Fight Club."},
{"fact":"Chuck Norris is currently in a legal battle with the makers of Bubble Tape. Norris claims &#8220;6 Feet of Fun&#8221; is actually the trademark for his penis."},
{"fact":"Chuck Norris is currently suing MySpace for taking the name of what he calls everything around you."},
{"fact":"Chuck Norris is currently suing NBC, claiming Law and Order are trademarked names for his left and right legs."},
{"fact":"Chuck Norris is Dr Watson."},
{"fact":"Chuck Norris is expected to win gold in every swimming competition at the 2008 Beijing Olympics, even though Chuck Norris does not swim. This is because when Chuck Norris enters the water, the water gets out of his way and Chuck Norris simply walks across the pool floor."},
{"fact":"Chuck Norris is his own line at the DMV."},
{"fact":"Chuck Norris is like a dog, not only because he can smell fear, but because he can piss on whatever he wants."},
{"fact":"Chuck Norris is mailer-daemon."},
{"fact":"Chuck Norris is my homeboy."},
{"fact":"Chuck Norris is not capable of hitting a target on the broad side of a barn. Every time he tries, the whole damn barn falls down."},
{"fact":"Chuck Norris is not hung like a horse &#8230; horses are hung like Chuck Norris."},
{"fact":"Chuck Norris is not Irish. His hair is soaked in the blood of his victims."},
{"fact":"Chuck Norris is not only a noun, but a verb."},
{"fact":"Chuck Norris is not Politically Correct. He is just Correct. Always."},
{"fact":"Chuck Norris is responsible for China&#8217;s over-population. He hosted a Karate tournament in Beijing and all women within 1,000 miles became pregnant instantly."},
{"fact":"Chuck Norris is so bad he makes viruses sick. As such, Chuck Norris is also responsible for the eradication of smallpox."},
{"fact":"Chuck Norris is so fast, he can run around the world and punch himself in the back of the head."},
{"fact":"Chuck Norris is ten feet tall, weighs two-tons, breathes fire, and could eat a hammer and take a shotgun blast standing."},
{"fact":"Chuck Norris is the Domain controller."},
{"fact":"Chuck Norris is the only human being to display the Heisenberg uncertainty principle &#8212; you can never know both exactly where and how quickly he will roundhouse-kick you in the face."},
{"fact":"Chuck Norris is the only known mammal in history to have an opposable thumb. On his penis."},
{"fact":"Chuck Norris is the only man to ever defeat a brick wall in a game of tennis."},
{"fact":"Chuck Norris is the only man who has, literally, beaten the odds. With his fists."},
{"fact":"Chuck Norris is the only person in the world that can actually email a roundhouse-kick."},
{"fact":"Chuck Norris is the only person to ever win a staring contest against Ray Charles and Stevie Wonder at the same time."},
{"fact":"Chuck Norris is the only person who can simultaneously hold and fire FIVE Uzis: One in each hand, one in each foot &#8212; and the 5th one he roundhouse-kicks into the air, so that it sprays bullets."},
{"fact":"Chuck Norris is the reason why Waldo is hiding."},
{"fact":"Chuck Norris is widely predicted to be first black president. If you&#8217;re thinking to yourself, &#8220;But Chuck Norris isn&#8217;t black&#8221;, then you are dead wrong. And stop being a racist."},
{"fact":"Chuck Norris just says &#8220;no&#8221; to drugs. If he said &#8220;yes&#8221;, it would collapse Colombia&#8217;s infrastructure."},
{"fact":"Chuck Norris keeps his friends close and his enemies closer. Close enough to drop them with one roundhouse-kick to the face."},
{"fact":"Chuck Norris kills anyone that asks, &#8220;You want fries with that&#8221; because by now everyone should know that Chuck does not ever want fries with anything. Ever."},
{"fact":"Chuck Norris knew you would say that."},
{"fact":"Chuck Norris knows everything there is to know &#8211; Except for the definition of mercy."},
{"fact":"Chuck Norris knows the last digit of pi."},
{"fact":"Chuck Norris let the dogs out."},
{"fact":"Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol."},
{"fact":"Chuck Norris likes his coffee like he likes his women: ground up, packed in a burlap sack, and thrown over the back of a camel."},
{"fact":"Chuck Norris likes his ice like he likes his skulls: crushed."},
{"fact":"Chuck Norris likes long walks on the beach, Barry White music, Harlequin romance novels, songbirds, rainbows, and quiet time with his lady &#8230; just before he roundhouse-kicks her in the face."},
{"fact":"Chuck Norris lost his virginity before his dad did."},
{"fact":"Chuck Norris make onions CRY!!!"},
{"fact":"Chuck Norris monitor has no glare &#8230; no-one glares at Chuck Norris."},
{"fact":"Chuck Norris needs a monkey wrench and a blowtorch to masturbate."},
{"fact":"Chuck Norris neither melts in your mouth nor in your hand. He shreds your trachea before ravaging your soul with a combination of chocolate, whiskey, roundhouse-kicks and death. Oh, and pain. Lots of pain."},
{"fact":"Chuck Norris never forgets to send the attachments with his outgoing emails."},
{"fact":"Chuck Norris never gets brain freeze. Slurpees know when to back the fuck off."},
{"fact":"Chuck Norris never gets the page cannot be displayed error."},
{"fact":"Chuck Norris never goes to the dentist because his teeth are unbreakable. His enemies never go to the dentist because they have no teeth."},
{"fact":"Chuck Norris never has to wax his skis because they&#8217;re always slick with blood."},
{"fact":"Chuck Norris never wet his bed as a child. The bed wet itself out of fear."},
{"fact":"Chuck Norris once ate a whole cake before his friends could tell him there was a stripper in it."},
{"fact":"Chuck Norris once ate an entire bottle of sleeping pills. They made him blink."},
{"fact":"Chuck Norris once ate four 30lb bowling balls without chewing."},
{"fact":"Chuck Norris once ate three 72 oz. steaks in one hour. He spent the first 45 minutes having sex with his waitress."},
{"fact":"Chuck Norris once bench-pressed the entire state of Ohio, and all of its residents."},
{"fact":"Chuck Norris once bet NASA he could survive re-entry without a spacesuit. On July 19th,1999, a naked Chuck Norris re-entered the earth&#8217;s atmosphere, streaking over 14 states and reaching a temperature of 3000 degrees. An embarrassed NASA publicly claimed it was a meteor, and still owes him a beer."},
{"fact":"Chuck Norris once challenged Lance Armstrong in a &#8220;Who has more testicles?&#8221; contest. Chuck Norris won by 5."},
{"fact":"Chuck Norris once created a flamethrower by urinating into a lighter."},
{"fact":"Chuck Norris once got into a fight with a one-armed Ninja. Seeing that he had an unfair advantage, Chuck Norris ripped both of his arms off and one of his legs. He then roundhouse-kicked the ninja in the head, killing him instantly, and proceeded to sow his limbs back on using only a rusty tent spike and bailing wire."},
{"fact":"Chuck Norris once had sex with a cigarette machine in the Osaka airport."},
{"fact":"Chuck Norris once invited all of the other badasses from TV to duke it out in order to see who was the supreme badass. Only two showed up&#8211; Jack Bauer and MacGyver."},
{"fact":"Chuck Norris once kicked a horse in the chin. Its descendants are known today as Giraffes."},
{"fact":"Chuck Norris once killed 5 people in less than a second. The only thing he said after this incident was, &#8220;Damn it, when Chuck Norris does not want Girl Scout cookies, Chuck Norris does not want Girl Scout cookies.&#8221;."},
{"fact":"Chuck Norris once lost the remote, but maintained control of the TV by yelling at it in between bites of his &#8220;Filet of Child&#8221; sandwich."},
{"fact":"Chuck Norris once ordered a steak in a restaurant. The steak did what it was told."},
{"fact":"Chuck Norris once participated in the running of the bulls. He walked."},
{"fact":"Chuck Norris once played rugby by himself. He went undefeated. Chuck Norris once played rugby by himself. He went undefeated."},
{"fact":"Chuck Norris once pulled out a single hair from his beard and skewered three men through the heart with it."},
{"fact":"Chuck Norris once rode a bull, and nine months later it had a calf."},
{"fact":"Chuck Norris once rode a nine foot grizzly bear through an automatic car wash, instead of taking a shower."},
{"fact":"Chuck Norris once roundhouse-kicked a salesman. Over the phone."},
{"fact":"Chuck Norris once roundhouse-kicked a ten dollar bill into 200 nickels."},
{"fact":"Chuck Norris once roundhouse-kicked Bruce Lee, breaking him in half. The result was Jet Li and Jackie Chan."},
{"fact":"Chuck Norris once roundhouse-kicked someone so hard that his foot broke the speed of light, went back in time, and killed Amelia Earhart while she was flying over the Pacific Ocean."},
{"fact":"Chuck Norris once shat blood &#8211; the blood of 11,940 natives he had killed and eaten."},
{"fact":"Chuck Norris once shot down a German fighter plane with his finger, by yelling, &#8220;Bang!&#8221;."},
{"fact":"Chuck Norris once skewered a man with the Eiffel tower."},
{"fact":"Chuck Norris once sued Burger King after they refused to put razor wire in his Whopper Jr, insisting that that actually is &#8220;his&#8221; way."},
{"fact":"Chuck Norris once sued the Houghton-Mifflin textbook company when it became apparent that their account of the war of 1812 was plagiarized from his autobiography."},
{"fact":"Chuck Norris once survived a suicide bombing. He was the bomber."},
{"fact":"Chuck Norris once visited the Virgin Islands. They are now The Islands."},
{"fact":"Chuck Norris once went on Celebrity Jeopardy and answered, &#8220;Who is Chuck Norris?&#8221; to every question. It was the first and only time in Jeopardy history that a contestant answered every single question right."},
{"fact":"Chuck Norris once went skydiving, but promised never to do it again. One Grand Canyon is enough."},
{"fact":"Chuck Norris once worked as a weatherman for the San Diego evening news. Every night he would make the same forecast: Partly cloudy with a 75% chance of Pain."},
{"fact":"Chuck Norris only uses one chopstick."},
{"fact":"Chuck Norris ordered a Big Mac at Burger King, and got one."},
{"fact":"Chuck Norris originally appeared in the &#8220;Street Fighter II&#8221; video game, but was removed by Beta Testers because every button caused him to do a roundhouse-kick. When asked bout this &#8220;glitch,&#8221; Norris replied, &#8220;That&#8217;s no glitch&#8221;."},
{"fact":"Chuck Norris originally wrote the first dictionary. The definition for each word is as follows &#8211; A swift roundhouse-kick to the face."},
{"fact":"Chuck Norris owns a chain of fast-food restaurants throughout the southwest. They serve nothing but barbecue-flavored ice cream and Hot Pockets."},
{"fact":"Chuck Norris owns the greatest Poker Face of all-time. It helped him win the 1983 World Series of Poker despite him holding just a Joker, a Get out of Jail Free Monopoly card, a 2 of clubs,7 of spades and a green #4 card from the game Uno."},
{"fact":"Chuck Norris played Russian Roulette with a fully loaded gun and won."},
{"fact":"Chuck Norris plays racquetball with a waffle iron and a bowling ball."},
{"fact":"Chuck Norris proved that we are alone in the universe. We weren&#8217;t before his first space expedition."},
{"fact":"Chuck Norris puts his pants on one leg at a time, just like the rest of us. The only difference is, then he kills people."},
{"fact":"Chuck Norris puts the &#8220;laughter&#8221; in &#8220;manslaughter&#8221;."},
{"fact":"Chuck Norris qualified with a top speed of 324 mph at the Daytona 500, without a car."},
{"fact":"Chuck Norris recently had the idea to sell his urine as a canned beverage. We know this beverage as Red Bull."},
{"fact":"Chuck Norris refers to himself in fourth person."},
{"fact":"Chuck Norris rips CDs with his hands."},
{"fact":"Chuck Norris roundhouse kicked his 14.4k modem &amp; thatâ€™s how we got ADSL."},
{"fact":"Chuck Norris roundhouse-kicks people in the face first and asks questions later."},
{"fact":"Chuck Norris runs on batteries. Specifically, Die Hards."},
{"fact":"Chuck Norris sheds his skin twice a year."},
{"fact":"Chuck Norris shot the sheriff, but he roundhouse-kicked the deputy."},
{"fact":"Chuck Norris sleeps with a night light. Not because Chuck Norris is afraid of the dark, but the dark is afraid of Chuck Norris."},
{"fact":"Chuck Norris sleeps with a pillow under his gun."},
{"fact":"Chuck Norris smells what the Rock is cooking &#8230; because the Rock is Chuck Norris&#8217; personal chef."},
{"fact":"Chuck Norris sold his soul to the devil for his rugged good looks and unparalleled martial arts ability. Shortly after the transaction was finalized, Chuck roundhouse-kicked the devil in the face and took his soul back. The devil, who appreciates irony, couldn&#8217;t stay mad and admitted he should have seen it coming. They now play poker every second Wednesday of the month."},
{"fact":"Chuck Norris stared evil in the face, and it backed down."},
{"fact":"Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe."},
{"fact":"Chuck Norris successfully separated twins conjoined at the head by roundhouse-kicking them in the face."},
{"fact":"Chuck Norris thought up some of the funniest Chuck Norris facts ever, but he hasn&#8217;t submitted them to the site because he does not believe in any form of submission."},
{"fact":"Chuck Norris trick-or-treated as himself as a child."},
{"fact":"Chuck Norris used to play baseball. When Babe Ruth was hailed as the better player, Chuck Norris killed him with a baseball bat to the throat. Lou Gehrig got off easy."},
{"fact":"Chuck Norris uses 8&#8217;x10&#8242; sheets of plywood as toilet paper."},
{"fact":"Chuck Norris uses a night light. Not because Chuck Norris is afraid of the dark, but the dark is afraid of Chuck Norris."},
{"fact":"Chuck Norris uses Notepad for a database."},
{"fact":"Chuck Norris uses Tabasco Sauce for eye drops."},
{"fact":"Chuck Norris visits an active volcano every morning to get some of &#8220;the best damn espresso on Earth&#8221;."},
{"fact":"Chuck Norris was banned from competitive bull riding after a 1992 exhibition in San Antonio, when he rode the bull 1,346 miles from Texas to Milwaukee Wisconsin to pick up his dry cleaning."},
{"fact":"Chuck Norris was once a knight in King Arthur&#8217;s court. He was known as Sir Beatdown."},
{"fact":"Chuck Norris was once in a knife fight, and the knife lost."},
{"fact":"Chuck Norris was once on Celebrity Wheel of Fortune and was the first to spin. The next 29 minutes of the show consisted of everyone standing around awkwardly, waiting for the wheel to stop."},
{"fact":"Chuck Norris was once on Jeopardy. This show is notable in that it was the first occasion in Jeopardy history that Alex Trebek had appeared without a mustache. And a head."},
{"fact":"Chuck Norris was sending an email one day, when he realized that it would be faster to run."},
{"fact":"Chuck Norris was the fourth wise man, who gave baby Jesus the gift of beard, which he carried with him until he died. The other three wise men were enraged by the preference that Jesus showed to Chuck&#8217;s gift, and arranged to have him written out of the bible. All three died soon after of mysterious roundhouse-kick related injuries."},
{"fact":"Chuck Norris was the original sculptor of Mount Rushmore. He completed the entire project using only a bottle opener and a drywall trowel."},
{"fact":"Chuck Norris was what Willis was talkin&#8217; about."},
{"fact":"Chuck Norris wears a live rattlesnake as a condom."},
{"fact":"Chuck Norris wears custom made boots with his name imprinted on the bottom. The reason being is so if anyone ever asks him for his autograph, they will get it permanently across the side of their face."},
{"fact":"Chuck Norris wears Orion&#8217;s Belt around his pinky toe and he eats with the Big Dipper."},
{"fact":"Chuck Norris website has never had a hit &#8211; Nobody hits Chuck Norris&#8217; website."},
{"fact":"Chuck Norris will attain statehood in 2009. His state flower will be the Magnolia."},
{"fact":"Chuck Norris will never have a heart attack. His heart isn&#8217;t nearly foolish enough to attack him."},
{"fact":"Chuck Norris wipes his ass with chain mail and sandpaper."},
{"fact":"Chuck Norris won super bowls VII and VIII single-handedly before unexpectedly retiring to pursue a career in ass-kicking."},
{"fact":"Chuck Norris&#8217; beard hair is believed to be an aphrodisiac in China."},
{"fact":"Chuck Norris&#8217; body temperature is 98.6 degrees &#8230; Celsius."},
{"fact":"Chuck Norris&#8217; calendar goes from March 31st to April 2nd, because no one fools Chuck Norris."},
{"fact":"Chuck Norris&#8217; cowboy boots are made from real cowboys."},
{"fact":"Chuck Norris&#8217; credit cards have no limit. Last weekend, he maxed them out."},
{"fact":"Chuck Norris&#8217; dick is so big, it has it&#8217;s own dick, and that dick is still bigger than yours."},
{"fact":"Chuck Norris&#8217; dog is trained to pick up his own poop because Chuck Norris will not take shit from anyone."},
{"fact":"Chuck Norris&#8217; favourite cereal is Kellogg&#8217;s Nails &#8216;N&#8217; Gravel."},
{"fact":"Chuck Norris&#8217; favourite cut of meat is the roundhouse."},
{"fact":"Chuck Norris&#8217; first job was as a paperboy. There were no survivors."},
{"fact":"Chuck Norris&#8217; hand is the only hand that can beat a Royal Flush."},
{"fact":"Chuck Norris&#8217; house has no doors, only walls that he walks through."},
{"fact":"Chuck Norris&#8217; PC speaker gives him 7.1 DTS surround sound."},
{"fact":"Chuck Norris&#8217; penis has a Hemi."},
{"fact":"Chuck Norris&#8217; penis is a third degree black belt, and an honourable 32nd-degree mason."},
{"fact":"Chuck Norris&#8217; pulse is measured on the Richter scale."},
{"fact":"Chuck Norris&#8217; roundhouse-kick is so powerful, it can be seen from outer space by the naked eye."},
{"fact":"Chuck Norris&#8217; roundhouse-kick is so powerful, that on the set of Sidekicks he single-footedly destroyed Jonathan Brandis&#8217; Career."},
{"fact":"Chuck Norris&#8217; roundhouse-kicks do not really kill people. They wipe out their entire existence from the space-time continuum."},
{"fact":"Chuck Norris&#8217; show is called Walker: Texas Ranger, because Chuck Norris does not run."},
{"fact":"Chuck Norris&#8217; sperm can be seen with the naked eye. Each one is the size of a quarter."},
{"fact":"Chuck Norris&#8217; sperm can penetrate 13 condoms, the birth control pill, a brick wall, and the 1975 Pittsburgh Steelers offensive line in order to impregnate a woman."},
{"fact":"Chuck Norris&#8217; sperm is so badass, he had sex with Nicole Kidman, and 7 months later she prematurely gave birth to a Ford Excursion."},
{"fact":"Chuck Norris&#8217; sweat has burned holes in concrete."},
{"fact":"Chuck Norris&#8217; tears cure cancer. Too bad he has never cried."},
{"fact":"Chuck Norris&#8217; testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy."},
{"fact":"Chuck Norris&#8217; version of a &#8220;chocolate milkshake&#8221; is a raw porterhouse wrapped around ten Hershey bars, and doused in diesel fuel."},
{"fact":"Chuck Norris&#8217;s Dot matrix printer prints photos &#8211; in colour."},
{"fact":"Chuck Norris, Vin Diesel and Arnold Schwarzenegger have all died and are in Heaven. Each of them hope to occupy the seat next to God. God asks Vin Diesel why he thinks he should have the seat and Vin replies, &#8220;I believe &#8230; I should have the seat because of the virtuosity in my toughness and pride.&#8221; Arnie says, &#8220;I believe &#8230; that I should be the one sitting next to you because of all my achievements.&#8221; God then turns to Chuck Norris, who replies with, &#8220;I believe &#8230; you are sitting in my seat.&#8221;."},
{"fact":"CNN was originally created as the &#8220;Chuck Norris Network&#8221; to update Americans with on-the-spot ass kicking in real-time."},
{"fact":"Contrary to popular belief, America is not a democracy, it is a Chucktatorship."},
{"fact":"Contrary to popular belief, Chuck Norris did not learn martial arts. He merely rediscovered the ancient, forgotten art of Chuck Norris."},
{"fact":"Contrary to popular belief, Chuck Norris, not the box jellyfish of northern Australia, is the most venomous creature on earth. Within 3 minutes of being bitten, a human being experiences the following symptoms: fever, blurred vision, beard rash, tightness of the jeans, and the feeling of being repeatedly kicked through a car windshield."},
{"fact":"Contrary to popular belief, George Bush is a great speaker and rarely mispronounces words. He appears incompetent because he knows Chuck Norris is watching."},
{"fact":"Contrary to popular belief, the Titanic didn&#8217;t hit an iceberg. The ship was off course and accidentally ran into Chuck Norris while he was doing the backstroke across the Atlantic."},
{"fact":"Contrary to popular belief, there is indeed enough Chuck Norris to go around."},
{"fact":"Coroners refer to dead people as &#8220;ABCs&#8221;. Already Been Chucked."},
{"fact":"Count from one to ten. That&#8217;s how long it would take Chuck Norris to kill you &#8230; Forty seven times."},
{"fact":"Crime does not pay &#8211; unless you are an undertaker following Walker, Texas Ranger, on a routine patrol."},
{"fact":"Crop circles are Chuck Norris&#8217; way of telling the world that sometimes corn needs to lie down."},
{"fact":"Diamonds are not, despite popular belief, carbon. They are, in fact, Chuck Norris&#8217; fecal matter. This was proven a recently, when scientific analysis revealed what appeared to be Jean-Claude Van Damme bone fragments inside the Hope Diamond."},
{"fact":"Dinosaurs went extinct because of the Chuck Norrisaurus."},
{"fact":"Divide Chuck Norris by zero and you will in fact get one &#8230; one bad-ass that is."},
{"fact":"Do you know why Baskin Robbins only has 31 flavors? Because Chuck Norris does not like Fudge Ripple."},
{"fact":"During the Vietnam War, Chuck Norris allowed himself to be captured. For torture, they made him eat his own entrails. He asked for seconds."},
{"fact":"Earth&#8217;s emergency defence plan in case of alien invasion is Chuck Norris."},
{"fact":"Every time Chuck Norris smiles, someone dies. Unless he smiles while he&#8217;s roundhouse-kicking someone in the face. Then two people die."},
{"fact":"Every time someone uses the word &#8220;intense&#8221;, Chuck Norris always replies &#8220;you know what else is intense?&#8221; followed by a roundhouse-kick to the face."},
{"fact":"Everybody loves Raymond. Except Chuck Norris."},
{"fact":"Everything King Midas touches turns to gold. Everything Chuck Norris touches turns up dead."},
{"fact":"Faster than a speeding bullet &#8230; more powerful than a locomotive &#8230; able to leap tall buildings in a single bound &#8230; yes, these are some of Chuck Norris&#8217; warm-up exercises."},
{"fact":"Fear is not the only emotion Chuck Norris can smell. He can also detect hope, as in &#8220;I hope I do not get a roundhouse-kick from Chuck Norris&#8221;."},
{"fact":"Fool me once, shame on you. Fool Chuck Norris once and he will roundhouse you in the face."},
{"fact":"For Chuck Norris, every street is &#8220;one way&#8221;. HIS WAY."},
{"fact":"For every movie about Vietnam starring Chuck Norris, the historical duration of the war decreases. Just 3 more &#8220;Missing in Action&#8221; sequels, and that war will have never actually existed."},
{"fact":"For most people, home is where the heart is. For Chuck Norris, home is where he stores his collection of human skulls."},
{"fact":"For some, the left testicle is larger than the right one. For Chuck Norris, each testicle is larger than the other one."},
{"fact":"For Spring Break &#8217;05, Chuck Norris drove to Madagascar, riding a chariot pulled by two electric eels."},
{"fact":"For undercover police work, Chuck Norris pins his badge underneath his shirt, directly into his chest."},
{"fact":"format c: is the request to have Chuck Norris come roundhouse kick your PC."},
{"fact":"Geico saved 15% by switching to Chuck Norris."},
{"fact":"Give a man a fish, and you will feed him for a day. Give a man anything that is better than a fish, and Chuck Norris will beat his ass and take it."},
{"fact":"Godzilla is a Japanese rendition of Chuck Norris&#8217; first visit to Tokyo."},
{"fact":"Google won&#8217;t search for Chuck Norris because it knows you do not find Chuck Norris, he finds you."},
{"fact":"Guantuanamo Bay, Cuba, is the military code-word for &#8220;Chuck Norris&#8217; basement&#8221;."},
{"fact":"Guns do not kill people. Chuck Norris kills people."},
{"fact":"He who lives by the sword, dies by the sword. He who lives by Chuck Norris, dies by the roundhouse-kick."},
{"fact":"He, who laughs last, laughs best. He who laughs at Chuck Norris &#8230; dies."},
{"fact":"Hellen Keller&#8217;s favourite colour is Chuck Norris."},
{"fact":"How many roundhouse-kicks does it take to get to the centre of a tootsie pop? Just one. From Chuck Norris."},
{"fact":"How much wood would a woodchuck chuck if a woodchuck could Chuck Norris? &#8230; All of it."},
{"fact":"Human cloning is outlawed because if Chuck Norris were cloned, then it would be possible for a Chuck Norris roundhouse-kick to meet another Chuck Norris roundhouse-kick. Physicists theorize that this contact would end the universe."},
{"fact":"If a tree falls in the forest, does anybody hear? Yes. Chuck Norris hears it. Chuck Norris can hear everything. Chuck Norris can hear the shrieking terror in your soul."},
{"fact":"If at first you do not succeed, you&#8217;re not Chuck Norris."},
{"fact":"If at first you don&#8217;t succeed, you are obviously not Chuck Norris."},
{"fact":"If Chuck Norris dies, then we will all die, because of the Ice Age. You see, the sun shines out of his ass."},
{"fact":"If Chuck Norris is late, time better slow the fuck down."},
{"fact":"If Chuck Norris roundhouse-kicks you, you will die. If Chuck Norris&#8217; misses you with the roundhouse-kick, the wind behind the kick will tear out your pancreas."},
{"fact":"If Chuck Norris wants your opinion, he&#8217;ll beat it into you."},
{"fact":"If Chuck Norris was in a room with Hitler, Stalin and David Hasselhoff, and he had a gun with 2 bullets, he&#8217;d shoot the Hoff twice."},
{"fact":"If Chuck Norris were a calendar, every month would be named Chucktober, and every day he&#8217;d kick your ass."},
{"fact":"If it looks like chicken, tastes like chicken, and feels like chicken but Chuck Norris says its beef, then it&#8217;s fucking beef."},
{"fact":"If it tastes like chicken, looks like chicken, and feels like chicken, but Chuck Norris says it&#8217;s beef &#8230; then it&#8217;s beef."},
{"fact":"If tapped, a Chuck Norris roundhouse-kick could power the country of Australia for 44 minutes."},
{"fact":"If you ask Chuck Norris what time it is, he always says, &#8220;Two seconds &#8217;til&#8221;. After you ask, &#8220;Two seconds &#8217;til what?&#8221; he roundhouse-kicks you in the face."},
{"fact":"If you can see Chuck Norris, he can see you. If you cannot see Chuck Norris you may be only seconds away from death."},
{"fact":"If you come home to find Chuck Norris doing your wife, it&#8217;s probably best to go fetch a glass of water and stand there in case Chuck gets thirsty. There ain&#8217;t no future in any other course of action."},
{"fact":"If you gave Chuck Norris a typewriter and 0.000000000000000000001th of a second he can write the Complete Works of Shakespeare."},
{"fact":"If you Google search &#8220;Chuck Norris getting his ass kicked&#8221; you will generate zero results. It just does not happen."},
{"fact":"If you rearrange the letters in &#8220;Chuck Norris&#8221;, they also spell &#8220;Crush Rock In&#8221;. The words &#8220;with his fists&#8221; are understood."},
{"fact":"If you see Chuck Norris crying he will grant you a wish, if your wish is dying."},
{"fact":"If you spell Chuck Norris in Scrabble, you win. Forever."},
{"fact":"If you try to introduce your mother to Chuck Norris, she&#8217;ll introduce you to your biological father."},
{"fact":"If you were somehow able to land a punch on Chuck Norris your entire arm would shatter upon impact. This is only in theory, since, come on, who in their right mind would try this?"},
{"fact":"If you work in an office with Chuck Norris, do not ask him for his three-hole-punch."},
{"fact":"If you&#8217;re driving down the road and you think Chuck Norris just cut you off, you better thank your lucky stars it wasn&#8217;t the other way around."},
{"fact":"If, by some incredible space-time paradox, Chuck Norris would ever fight himself, he&#8217;d win. Period."},
{"fact":"In 1990, Chuck Norris founded the non-profit organization &#8220;Kick Drugs Out of America&#8221;. If the organization&#8217;s name were &#8220;roundhouse-kick Drugs out of America&#8221;, there wouldn&#8217;t be any drugs in the Western Hemisphere. Anywhere."},
{"fact":"In 96 hours, Jack Bauer (&#8220;24&#8221;) has killed 93 people and saved the world 4 times. Chuck Norris does that in every episode of Walker: Texas Ranger."},
{"fact":"In a fight between Batman and Darth Vader, the winner would be Chuck Norris."},
{"fact":"In a recent survey it was discovered the 94% of American women lost their virginity to Chuck Norris. The other 6% were incredibly fat or ugly."},
{"fact":"In a tag team match, Chuck Norris was teamed with Hulk Hogan against King Kong Bundy and Andre The Giant. He pinned all 3 at the same time."},
{"fact":"In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research."},
{"fact":"In an average living room there are 1,242 objects Chuck Norris could use to kill you, including the room itself."},
{"fact":"In an emergency, Chuck Norris can be used as a floatation device."},
{"fact":"In ancient China there is a legend that one day a child will be born from a dragon, grow to be a man, and vanquish evil from the land. That man is not Chuck Norris, because Chuck Norris killed that man."},
{"fact":"In Desert Storm the reason why the Iraqi army surrendered so quickly because they knew Chuck Norris was coming.."},
{"fact":"In Desert Storm the reason why the Iraqi army surrendered so quickly because they knew Chuck Norris was coming."},
{"fact":"In honour of Chuck Norris, all McDonald&#8217;s in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized."},
{"fact":"In order to survive a nuclear attack, you must remember to stop, drop, and be Chuck Norris."},
{"fact":"In the beginning there was nothing &#8230; then Chuck Norris roundhouse-kicked that nothing in the face and said &#8220;Get a job&#8221;. That is the story of the universe."},
{"fact":"In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer."},
{"fact":"In the first Jurassic Park movie, the Tyrannosaurus Rex wasn&#8217;t chasing the jeep. Chuck Norris was chasing the Tyrannosaurus AND the jeep."},
{"fact":"In the medical community, death is referred to as &#8220;Chuck Norris Disease&#8221;."},
{"fact":"In the movie &#8220;The Matrix&#8221;, Chuck Norris is the Matrix. If you pay close attention in the green &#8220;falling code&#8221; scenes, you can make out the faint texture of his beard."},
{"fact":"In the Words of Julius Caesar, &#8220;Veni, Vidi, Vici, Chuck Norris&#8221;. Translation: I came, I saw, and I was roundhouse-kicked in the face by Chuck Norris."},
{"fact":"In the X-Men movies, none of the X-Men super-powers are done with special effects. Chuck Norris is the stuntman for every character."},
{"fact":"Industrial logging isn&#8217;t the cause of deforestation. Chuck Norris needs toothpicks."},
{"fact":"Instead of having a cigarette after sex, Chuck Norris heads outside and brands his cattle."},
{"fact":"It is believed dinosaurs are extinct due to a giant meteor. That&#8217;s true if you want to call Chuck Norris a giant meteor."},
{"fact":"It is better to give than to receive. This is especially true of a Chuck Norris roundhouse-kick."},
{"fact":"It is impossible to be raped by Chuck Norris because that would mean you did not want it to happen."},
{"fact":"It is said that every time you masturbate, God kills a kitten. Every time God masturbates, Chuck Norris kills a lion."},
{"fact":"It is said that looking into Chuck Norris&#8217; eyes will reveal your future. Unfortunately, everybody&#8217;s future is always the same: death by a roundhouse-kick to the face."},
{"fact":"It is scientifically impossible for Chuck Norris to have had a mortal father. The most popular theory is that he went back in time and fathered himself."},
{"fact":"It is widely believed that Jesus was Chuck Norris&#8217; stunt double for crucifixion due to the fact that it is impossible for nails to pierce Chuck Norris&#8217; skin."},
{"fact":"It takes 14 puppeteers to make Chuck Norris smile, but only 2 to make him destroy an orphanage."},
{"fact":"It takes Chuck Norris 20 minutes to watch 60 Minutes."},
{"fact":"Jack Bauer tried to use his detailed knowledge of torture techniques, but to no avail: Chuck Norris thrives on pain. Chuck Norris then ripped off Jack Bauer&#8217;s arm and beat him to death with it. Game, set, match."},
{"fact":"James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger."},
{"fact":"Jean-Claude Van Damme once kicked Chuck Norris&#8217; ass. He was then awakened from his dream by a roundhouse-kick to the face."},
{"fact":"Jeeves asks Chuck Norris."},
{"fact":"Jesus can walk on water, but Chuck Norris can walk on Jesus."},
{"fact":"Jesus owns and wears a bracelet that reads, &#8220;WWCND?&#8221;."},
{"fact":"July 4th is Independence day. And the day Chuck Norris was born. Coincidence? i think not."},
{"fact":"Kenny G is allowed to live because Chuck Norris does not kill women."},
{"fact":"Kryptonite has been found to contain trace elements of Chuck Norris roundhouse-kicks to the face. This is why it is so deadly to Superman."},
{"fact":"Leading hand sanitizers claim they can kill 99.9 percent of germs. Chuck Norris can kill 100 percent of whatever the fuck he wants."},
{"fact":"Life is like a box of chocolates. You never know when Chuck Norris is going to kill you."},
{"fact":"Life is not, in fact, like a box of chocolates. It is more like a box of Chuck Norris, roundhouse-kicking you in the face. And if you receive a box of Chuck Norris, you ALWAYS know what you are going to get."},
{"fact":"Lightning never strikes twice in one place because Chuck Norris is looking for it."},
{"fact":"Little kids enjoy lighting ants on fire with magnifying glasses. Chuck Norris enjoys lighting little kids on fire with ants. Scientists have yet to find out how this feat is achieved."},
{"fact":"Little known medical fact: Chuck Norris invented the Caesarean section when he roundhouse-kicked his way out of his mother&#8217;s womb."},
{"fact":"Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse-kicked her into a glacier."},
{"fact":"Love does not hurt. Chuck Norris does."},
{"fact":"MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it."},
{"fact":"MacGyver immediately tried to make a bomb out of some Q-Tips and Gatorade, but Chuck Norris roundhouse-kicked him in the solar plexus. MacGyver promptly threw up his own heart."},
{"fact":"Machine code is another name for Chuck Norris language."},
{"fact":"Maslow&#8217;s theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill."},
{"fact":"Men are ok with their wives fantasising about Chuck Norris during sex; because they are doing the same thing."},
{"fact":"Most boots are made for walkin&#8217;. Chuck Norris&#8217; boots ain&#8217;t that merciful."},
{"fact":"Most men are okay with their wives fantasizing about Chuck Norris during sex, because they are doing the same thing."},
{"fact":"Most people fear the Reaper. Chuck Norris considers him &#8220;a promising Rookie&#8221;."},
{"fact":"Most people have 23 pairs of chromosomes. Chuck Norris has 72 &#8230; and they&#8217;re all poisonous."},
{"fact":"Most people know that Descartes said, &#8220;I think, therefore I am&#8221;. What most people do not know is that that quote continues, &#8221; &#8230; afraid of Chuck Norris&#8221;."},
{"fact":"Most tough men eat nails for breakfast. Chuck Norris does all of his grocery shopping at Home Depot."},
{"fact":"Movie trivia: The movie &#8220;Invasion U.S.A.&#8221; is, in fact, a documentary."},
{"fact":"Mr. T pities the fool. Chuck Norris rips the fool&#8217;s head off."},
{"fact":"Nagasaki never had a bomb dropped on it. Chuck Norris jumped out of a plane and punched the ground."},
{"fact":"Never look a gift Chuck Norris in the mouth, because he will bite your damn eyes off."},
{"fact":"Newton&#8217;s Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse-kick."},
{"fact":"Ninjas want to grow up to be just like Chuck Norris. But usually they grow up just to be killed by Chuck Norris."},
{"fact":"No matter what your mother always said, Chuck Norris can tune a fish."},
{"fact":"Noah was the only man notified before Chuck Norris relieved himself in the Atlantic Ocean."},
{"fact":"Nobody does not like Sara Lee. Except Chuck Norris."},
{"fact":"Not everyone that Chuck Norris is mad at gets killed. Some get away. They are called astronauts."},
{"fact":"Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken."},
{"fact":"Occam&#8217;s Razor says that the simplest answer tends to be the correct one. Norris&#8217; Razor involves a flick of the wrist and a Columbian Necktie."},
{"fact":"On his birthday, Chuck Norris randomly selects one lucky child to be thrown into the sun."},
{"fact":"On the SAT if you put Chuck Norris for every answer you will score over 8000."},
{"fact":"On the set of Walker Texas Ranger Chuck Norris brought a dying lamb back to life by nuzzling it with his beard. As the onlookers gathered, the lamb sprang to life. Chuck Norris then roundhouse-kicked it, killing it instantly. This was just to prove that the good Chuck giveth, and the good Chuck, he taketh away."},
{"fact":"On Valentine&#8217;s Day, Chuck Norris gives his wife the still beating heart of one of his enemies. Being very romantic, Chuck Norris believes every day should be Valentine&#8217;s Day."},
{"fact":"Once you go Norris, you are physically unable to go back."},
{"fact":"One day Chuck Norris walked down the street with a massive erection. There were no survivors."},
{"fact":"One time I was with Norris in the back of a pickup truck, along with a live deer. Norris goes up to the deer and says, &#8216;I&#8217;m Chuck Norris! SAY IT!&#8217; Then he manipulates the deer&#8217;s lips in such a way as to make it say, &#8216;ChuckNorris&#8217; &#8230; It wasn&#8217;t exactly like it, but it was pretty good for a deer!&#8217;."},
{"fact":"One time in an airport a guy accidently called Chuck Norris &#8220;Chick Norris&#8221;. He explained it was an honest mistake and apologized profusely. Chuck accepted his apology and politely signed an autograph. Nine months later, the guy&#8217;s wife gave birth to a bearded baby. The guy knew exactly what had happened, and blames nobody but himself."},
{"fact":"One time, at band camp, Chuck Norris ate a percussionist."},
{"fact":"One time, Chuck Norris accidentally stubbed his toe. It destroyed the entire state of Ohio."},
{"fact":"Only Chuck Norris can prevent forest fires."},
{"fact":"Outer space exists because it&#8217;s afraid to be on the same planet with Chuck Norris."},
{"fact":"Oxygen requires Chuck Norris to live."},
{"fact":"Ozzy Osbourne bites the heads off of bats. Chuck Norris bites the heads off of Siberian Tigers."},
{"fact":"Paper beats rock, rock beats scissors, and scissors beats paper, but Chuck Norris beats all 3 at the same time."},
{"fact":"Pee Wee Herman got arrested for masturbating in public. The same day, Chuck Norris got an award for masturbating in public."},
{"fact":"People created the automobile to escape from Chuck Norris &#8230; Not to be outdone, Chuck Norris created the automobile accident."},
{"fact":"People have often asked the United States, What is your secret weapon against terrorists? We simply reply &#8230; Chuck Norris."},
{"fact":"Pluto is actually an orbiting group of British soldiers from the American Revolution who entered space after the Chuck gave them a roundhouse-kick to the face."},
{"fact":"Police label anyone attacking Chuck Norris as a Code 45-11 &#8230; a suicide."},
{"fact":"President Roosevelt once rode his horse 100 miles. Chuck Norris carried his the same distance in half the time."},
{"fact":"Proponents of higher-order theories of consciousness argue that consciousness is explained by the relation between two levels of mental states in which a higher-order mental state takes another mental state. If you mention this to Chuck Norris, expect an explosive roundhouse-kick to the face for spouting too much fancy-talk."},
{"fact":"Q: How many Chuck Norris&#8217; does it take to change a light bulb? A: None, Chuck Norris prefers to kill in the dark."},
{"fact":"Remember the Soviet Union? They decided to quit after watching a DeltaForce marathon on Satellite TV."},
{"fact":"Remember The Ultimate Warrior? He quit wrestling because Chuck Norris wanted his nickname back."},
{"fact":"Rules of fighting: 1) do not bring a knife to a gun fight. 2) do not bring a gun to a Chuck Norris fight."},
{"fact":"Saddam Hussein was not found hiding in a &#8220;hole&#8221;. Saddam was roundhouse-kicked in the head by Chuck Norris in Kansas, which sent him through the earth, stopping just short of the surface of Iraq."},
{"fact":"Science Fact: roundhouse-kicks are comprised primarily of an element called Chucktanium."},
{"fact":"Scientifically speaking, it is impossible to charge Chuck Norris with &#8220;obstruction of justice&#8221;. This is because even Chuck Norris cannot be in two places at the same time."},
{"fact":"Scientists believe the world began with the &#8220;Big Bang&#8221;. Chuck Norris shrugs it off as a &#8220;bad case of gas&#8221;."},
{"fact":"Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris roundhouse-kick)."},
{"fact":"Scotty in Star Trek often says &#8220;Ye cannae change the laws of physics&#8221;. This is untrue. Chuck Norris can change the laws of physics. With his fists."},
{"fact":"Similar to a Russian Nesting Doll, if you were to break Chuck Norris open you would find another Chuck Norris inside, only smaller and angrier."},
{"fact":"Simply by pulling on both ends, Chuck Norris can stretch diamonds back into coal."},
{"fact":"Since 1940, the year Chuck Norris was born, roundhouse-kick related deaths have increased 13,000 percent."},
{"fact":"Some kids play Kick the can. Chuck Norris played Kick the keg."},
{"fact":"Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag."},
{"fact":"Some people like to eat frogs&#8217; legs. Chuck Norris likes to eat lizard legs. Hence, snakes."},
{"fact":"Some people say that Chuck Norris is a myth. Those &#8220;some people&#8221; are now dead."},
{"fact":"Some people wear Superman pajamas. Superman wears Chuck Norris pajamas."},
{"fact":"Someone once tried to tell Chuck Norris that roundhouse-kicks aren&#8217;t the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made."},
{"fact":"Someone once videotaped Chuck Norris getting pissed off. It was called Walker: Texas Chain Saw Masacre."},
{"fact":"Staring at Chuck Norris for extended periods of time without proper eye protection will cause blindness, and possibly foot sized bruises on the face."},
{"fact":"Sticks and stones may break your bones, but a Chuck Norris glare will liquefy your kidneys."},
{"fact":"Superman once watched an episode of Walker, Texas Ranger. He then cried himself to sleep."},
{"fact":"Superman owns a pair of Chuck Norris pajamas."},
{"fact":"Sweating bullets is literally what happens when Chuck Norris gets too hot."},
{"fact":"Switzerland isn&#8217;t really neutral. They just haven&#8217;t figured out what side Chuck Norris is on yet."},
{"fact":"Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate."},
{"fact":"That is not Chuck Norris doing push-ups &#8212; that&#8217;s Chuck Norris moving the Earth away from the path of a deadly asteroid."},
{"fact":"The 11th commandment is &#8220;Thou shalt not piss off Chuck Norrisâ€. This commandment is rarely enforced, as it is impossible to accomplish."},
{"fact":"The 1972 Miami Dolphins lost one game, it was an exhibition game vs. Chuck Norris and three seven year old girls. Chuck Norris won with a roundhouse-kick to the face in overtime."},
{"fact":"The active ingredient in Red Bull is Chuck Norris&#8217; sweat."},
{"fact":"The air around Chuck Norris is always a balmy 78 degrees."},
{"fact":"The Bermuda Triangle used to be the Bermuda Square, until Chuck Norris roundhouse-kicked one of the corners off."},
{"fact":"The best part of waking up, is not Folgers in your cup, but knowing that Chuck Norris didn&#8217;t kill you in your sleep."},
{"fact":"The best-laid plans of mice and men often go awry. Even the worst-laid plans of Chuck Norris come off without a hitch."},
{"fact":"The Bible was originally titled &#8220;Chuck Norris and Friends&#8221;."},
{"fact":"The chemical formula for the highly toxic cyanide ion is CN-. These are also Chuck Norris&#8217; initials. This is not a coincidence."},
{"fact":"The chief export of Chuck Norris is pain."},
{"fact":"The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn."},
{"fact":"The crossing lights in Chuck Norris&#8217; home town say &#8220;Die slowly&#8221; and &#8220;die quickly&#8221;. They each have a picture of Chuck Norris punching or kicking a pedestrian."},
{"fact":"The dot-com bubble burst because Chuck Norris roundhouse-kicked it in the face."},
{"fact":"The Drummer for Def Leppard&#8217;s only got one arm. Chuck Norris needed a back scratcher."},
{"fact":"The easiest way to determine Chuck Norris&#8217; age is to cut him in half and count the rings."},
{"fact":"The First Law of Thermodynamics states that energy can neither be created nor destroyed &#8230; unless it meets Chuck Norris."},
{"fact":"The First Rule of Chuck Norris is: you do not talk about Chuck Norris."},
{"fact":"The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears."},
{"fact":"The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably."},
{"fact":"The helicopter was invented after Chuck Norris was observed doing 8 roundhouse-kicks a second."},
{"fact":"The last thing you hear before Chuck Norris gives you a roundhouse-kick? No one knows because dead men tell no tales."},
{"fact":"The leading causes of death in the United States are: 1. Heart Disease 2. Chuck Norris 3. Cancer."},
{"fact":"The Manhattan Project was not intended to create nuclear weapons, it was meant to recreate the destructive power in a Chuck Norris roundhouse-kick. They didn&#8217;t even come close."},
{"fact":"The most effective form of suicide known to man is to type &#8220;Chuck Norris&#8221; into Google and hit &#8220;I&#8217;m Feeling Lucky!&#8221;."},
{"fact":"The movie &#8220;Delta Force&#8221; was extremely hard to make because Chuck had to downplay his abilities. The first few cuts were completely unbelievable."},
{"fact":"The only reason Chuck Norris didn&#8217;t win an Oscar for his performance in &#8220;Sidekicks&#8221; is because nobody in their right mind would willingly give Chuck Norris a blunt metal object. That&#8217;s just suicide."},
{"fact":"The only sure things are Death and Taxes &#8230; and when Chuck Norris goes to work for the IRS, they&#8217;ll be the same thing."},
{"fact":"The only thing we have to fear is fear itself &#8230; The only thing fear has to fear is Chuck Norris."},
{"fact":"The opening scene of the movie &#8220;Saving Private Ryan&#8221; is loosely based on games of dodgeball Chuck Norris played in second grade."},
{"fact":"The original draft of The Lord of the Rings featured Chuck Norris instead of Frodo Baggins. It was only 5 pages long, as Chuck roundhouse-kicked Sauron&#8217;s ass halfway through the first chapter."},
{"fact":"The original title for Alien vs. Predator was Alien and Predator vs Chuck Norris. The film was cancelled shortly after going into preproduction. No one would pay nine dollars to see a movie fourteen seconds long."},
{"fact":"The original title for Star Wars was &#8220;Skywalker: Texas Ranger&#8221;. Starring Chuck Norris."},
{"fact":"The pen is mightier than the sword, but only if the pen is held by Chuck Norris."},
{"fact":"The phrase &#8220;balls to the wall&#8221; was originally conceived to describe Chuck Norris entering any building smaller than an aircraft hangar."},
{"fact":"The phrase &#8220;break a leg&#8221; was originally coined by Chuck Norris&#8217; co-stars in Walker, Texas Ranger as a good luck charm, indicating that a broken leg might be the worst extent of their injuries. This never proved to be the case."},
{"fact":"The phrase &#8220;dead ringer&#8221; refers to someone who sits behind Chuck Norris in a movie theater and forgets to turn their cell phone off."},
{"fact":"The phrase &#8220;Made by Chuck Norris&#8221; is imprinted beneath the surface of China."},
{"fact":"The pie scene in &#8220;American Pie&#8221; is based on a dare Chuck Norris took when he was younger. However, in Chuck Norris&#8217; case, the &#8220;pie&#8221; was the molten crater of an active volcano."},
{"fact":"The quickest way to a man&#8217;s heart is with Chuck Norris&#8217; fist."},
{"fact":"The reason newborn babies cry is because they know they have just entered a world with Chuck Norris."},
{"fact":"The Seven Wonders of the ancient world were: Chuck Norris&#8217; left and right hands, his left and right feet, his belly button, his liver, and his beard."},
{"fact":"The Sherman tank was originally called the Norris tank until Chuck Norris decided it wasn&#8217;t tough enough to be associated with him. The Army, for fear of Chuck Norris, renamed the tank and promised to develop a weapon more fitting of his name. To date, no weapon created has been badass enough to be named after Chuck Norris."},
{"fact":"The show Survivor had the original premise of putting people on an island with Chuck Norris. There were no survivors, and nobody is brave enough to go to the island to retrieve the footage."},
{"fact":"The speed of light was instituted because Chuck Norris didn&#8217;t want get winded outrunning it. Chuck Norris hates to sweat."},
{"fact":"The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death."},
{"fact":"The term &#8220;Cleveland Steamer&#8221; got its name from Chuck Norris, when he took a dump while visiting the Rock and Roll Hall of fame and buried northern Ohio under a glacier of fecal matter."},
{"fact":"The truth will set you free. Unless Chuck Norris has you, in which case, forget it buddy!"},
{"fact":"The United States could save billions in defense funding if they trade the Military for Chuck Norris."},
{"fact":"The US did not boycott the 1980 Summer Olympics in Moscow due to political reasons: Chuck Norris killed the entire US team with a single roundhouse-kick during TaeKwonDo practice."},
{"fact":"The wind of Chuck Norris&#8217; roundhouse-kick can be felt from 1600 million miles away."},
{"fact":"The word &#8216;Kill&#8217; was invented by Chuck Norris. Other words were &#8216;Die&#8217;, &#8216;Beer&#8217;, and &#8216;What&#8217;."},
{"fact":"The world&#8217;s fastest car has 7 gears. 5,6, and Chuck Norris."},
{"fact":"There are four legal methods of execution in the United States: lethal injection, gas chamber, electric chair and Chuck Norris."},
{"fact":"There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue."},
{"fact":"There are no steroids in baseball. Just players Chuck Norris has breathed on."},
{"fact":"There are no such thing as lesbians, just women who have never met Chuck Norris.."},
{"fact":"There are no such things as tornados. Chuck Norris just hates trailer parks."},
{"fact":"There are no weapons of mass destruction in Iraq, Chuck Norris lives in Oklahoma."},
{"fact":"There are now five cup sizes at Starbucks: Short, Tall, Grande, Venti, and Chuck Norris."},
{"fact":"There are only two things that can cut diamonds: other diamonds, and Chuck Norris."},
{"fact":"There are two types of people in the world &#8230; people that suck, and Chuck Norris."},
{"fact":"There is an order to the universe: space, time, Chuck Norris &#8230; Just kidding, Chuck Norris is first."},
{"fact":"There is endless debate about the existence of the human soul. Well it does exist, and Chuck Norris finds it delicious."},
{"fact":"There is in fact an &#8220;I&#8221; in Norris, but there is no &#8220;team&#8221; &#8230; not even close."},
{"fact":"There is no chin behind Chuck Norris&#8217; beard. There is only another fist."},
{"fact":"There is no Control button on Chuck Norris&#8217; computer. Chuck Norris is always in control."},
{"fact":"There is no such thing as a lesbian, just a woman who has never met Chuck Norris."},
{"fact":"There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up."},
{"fact":"There is no theory of evolution, just a list of creatures Chuck Norris allows to live."},
{"fact":"They had to edit the first ending of &#8216;Lone Wolf McQuade&#8217; after Chuck Norris kicked David Carradine&#8217;s ass, then proceeded to barbecue and eat him."},
{"fact":"They once made a Chuck Norris toilet paper, but there was a problem &#8211; It wouldn&#8217;t take shit from anybody."},
{"fact":"They say curiosity killed the cat. This is false. Chuck Norris killed the cat. Every single one of them."},
{"fact":"They say that lightning never strikes the same place twice. Niether does Chuck Norris. He does not have to."},
{"fact":"They were going to release a Chuck Norris edition of Clue, but the answer always turns out to be &#8220;Chuck Norris. In The Library. With a roundhouse-kick&#8221;."},
{"fact":"Think of a hot woman. Chuck Norris did her."},
{"fact":"Those aren&#8217;t credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode."},
{"fact":"Thousands of years ago Chuck Norris came across a bear. It was so terrified that it fled north into the arctic. It was also so terrified that all of its descendants now have white hair."},
{"fact":"Time waits for no man. Unless that man is Chuck Norris."},
{"fact":"TNT was originally developed by Chuck Norris to cure indigestion."},
{"fact":"To be or not to be? That is the question. The answer? Chuck Norris."},
{"fact":"Tom Clancy has to pay royalties to Chuck Norris because &#8220;The Sum of All Fears&#8221; is the name of Chuck Norris&#8217; autobiography."},
{"fact":"Two wrongs do not make a right. Unless you&#8217;re Chuck Norris. Then two wrongs make a roundhouse-kick to the face."},
{"fact":"Using his trademark roundhouse-kick, Chuck Norris once made a field goal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego."},
{"fact":"Water boils faster when Chuck Norris watches it."},
{"fact":"We all know the magic word is please. As in the sentence, &#8220;Please don&#8217;t kill me.&#8221; Too bad Chuck Norris does not believe in magic."},
{"fact":"We live in an expanding universe. All of it is trying to get away from Chuck Norris."},
{"fact":"What is known as the UFC, or Ultimate Fighting Championship, does not use its full name, which happens to be &#8220;Ultimate Fighting Championship, Non-Chuck-Norris-Division&#8221;."},
{"fact":"What many people do not know is Chuck Norris is the founder of planned parenthood. Not even unborn children can escape his wrath."},
{"fact":"What was going through the minds of all of Chuck Norris&#8217; victims before they died? His shoe."},
{"fact":"When an episode of Walker Texas Ranger was aired in France, the French surrendered to Chuck Norris just to be on the safe side."},
{"fact":"When Arnold says the line &#8220;I&#8217;ll be back&#8221; in the first Terminator movie it is implied that is he going to ask Chuck Norris for help."},
{"fact":"When Bruce Banner gets mad, he turns into the Hulk. When the Hulk gets mad, he turns into Chuck Norris."},
{"fact":"When Chuck Norris answers the phone, he just says &#8220;Go&#8221;. This is not permission for you to begin speaking, it is your cue to start running for your life."},
{"fact":"When Chuck Norris calls 1-900 numbers, he does not get charged. He holds up the phone and money falls out."},
{"fact":"When Chuck Norris does a pushup, he isn&#8217;t lifting himself up, he&#8217;s pushing the Earth down."},
{"fact":"When Chuck Norris does division, there are no remainders."},
{"fact":"When Chuck Norris exercises, the machine gets stronger."},
{"fact":"When Chuck Norris falls in water, Chuck Norris does not get wet. Water gets Chuck Norris."},
{"fact":"When Chuck Norris found this web-site while surfing the Internet, he roundhouse-kicked his computer &#8230; 10 new facts were added instantly including this one."},
{"fact":"When Chuck Norris gives you the finger, he&#8217;s telling you how many seconds you have left to live."},
{"fact":"When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket."},
{"fact":"When Chuck Norris goes to out to eat, he orders a whole chicken, but he only eats its soul."},
{"fact":"When Chuck Norris goes to Vegas, he does not have to gamble. The casinos just give him stacks of money."},
{"fact":"When Chuck Norris has sex with a man, it won&#8217;t be because he is gay. It will be because he has run out of women."},
{"fact":"When Chuck Norris is in a crowded area, he does not walk around people. He walks through them."},
{"fact":"When Chuck Norris is ready to wake up, he tells the sun to get the above the horizon."},
{"fact":"When Chuck Norris laughs too hard while drinking milk, he accidently shits a cow."},
{"fact":"When Chuck Norris makes a burrito, its main ingredient is real toes."},
{"fact":"When Chuck Norris plays Monopoly, it affects the actual world economy."},
{"fact":"When Chuck Norris plays Oregon Trail, his family does not die from cholera or dysentery, but rather, roundhouse-kicks to the face. He also requires no wagon, since he carries the oxen, axels, and buffalo meat on his back. He always makes it to Oregon before you."},
{"fact":"When Chuck Norris says &#8220;More cowbell&#8221;, he MEANS it."},
{"fact":"When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes, ever."},
{"fact":"When Chuck Norris sneeze, he do not say &#8220;Atchoo&#8221; he says &#8220;DIE EVERYONE!!!&#8221;. That&#8217;s what happens next."},
{"fact":"When Chuck Norris spits out watermelon seeds, he puts a machine gun to shame."},
{"fact":"When Chuck Norris talks, everybody listens. And dies."},
{"fact":"When Chuck Norris wants an egg, he cracks open a chicken."},
{"fact":"When Chuck Norris was a baby, he didn&#8217;t suck his mother&#8217;s breast. His mother served him whiskey, straight out of the bottle."},
{"fact":"When Chuck Norris was a child, he made his mother finish his vegetables."},
{"fact":"When Chuck Norris was born, he immediately had sex with the first nurse he saw. He was her first. She was his third. That afternoon."},
{"fact":"When Chuck Norris was born, the only person who cried was the doctor. Never slap Chuck Norris."},
{"fact":"When Chuck Norris was denied an Egg McMuffin at McDonald&#8217;s because it was 10: 35, he roundhouse-kicked the store so hard it became a Wendy&#8217;s."},
{"fact":"When Chuck Norris was in middle school, his English teacher assigned an essay: &#8220;What is Courage?&#8221; Chuck Norris received an &#8220;A+&#8221; for writing only the words &#8220;Chuck Norris&#8221; and promptly turning in the paper."},
{"fact":"When Chuck Norris works out on the Total Gym, the Total Gym feels like it&#8217;s been raped."},
{"fact":"When God said, &#8220;let there be light&#8221;, Chuck Norris said, &#8220;say &#8216;please'&#8221;."},
{"fact":"When in a bar, you can order a drink called a &#8220;Chuck Norris&#8221;. It is also known as a &#8220;Bloody Mary&#8221;, if your name happens to be Mary."},
{"fact":"When J. Robert Oppenheimer said &#8220;I am become death, the destroyer Of worlds&#8221;, He was not referring to the atomic bomb. He was referring to the Chuck Norris halloween costume he was wearing."},
{"fact":"When somebody yells &#8220;Last one in is a rotten egg,&#8221; Chuck Norris is never the rotten egg."},
{"fact":"When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part."},
{"fact":"When taking the SAT, write &#8220;Chuck Norris&#8221; for every answer. You will score over 8000."},
{"fact":"When the Boogeyman goes to sleep every night, he checks his closet for Chuck Norris."},
{"fact":"When you open a can of whoop-ass, Chuck Norris jumps out."},
{"fact":"When you play Monopoly with Chuck Norris, you do not pass go, and you do not collect two hundred dollars. You will be lucky if you make it out alive."},
{"fact":"When you say &#8220;no one&#8217;s perfect&#8221;, Chuck Norris takes this as a personal insult."},
{"fact":"When you&#8217;re Chuck Norris, anything + anything is equal to 1. One roundhouse-kick to the face."},
{"fact":"Whenever someone is constipated, doctors send them to Chuck Norris so he can scare the shit out of them."},
{"fact":"While urinating, Chuck Norris is easily capable of welding titanium."},
{"fact":"Who let the dogs out? Chuck Norris let the dogs out &#8230; and then roundhouse-kicked them through an Oldsmobile."},
{"fact":"Whoever said &#8220;only the good die young&#8221; was probably in Chuck Norris&#8217; kindergarten class."},
{"fact":"Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this &#8220;a slow Tuesday&#8221;."},
{"fact":"With the rising cost of gasoline, Chuck Norris is beginning to worry about his drinking habit."},
{"fact":"You can lead a horse to water but cannot make him drink, unless you&#8217;re Chuck Norris."},
{"fact":"You know how they say if you die in your dream then you will die in real life? In actuality, if you dream of death then Chuck Norris will find you and kill you."}]